[
    {
        "type": "Single Family Home",
        "description": "A standalone house designed for one family."
    },
    {
        "type": "Condo",
        "description": "A unit within a larger building, typically owned individually."
    },
    {
        "type": "Apartment",
        "description": "A rented dwelling unit in a multi-unit building."
    },
    {
        "type": "Townhouse",
        "description": "A multi-story house attached to other similar houses in a row."
    },
    {
        "type": "Duplex",
        "description": "A building with two separate dwelling units."
    },
    {
        "type": "Mobile Home",
        "description": "A movable home that can be transported on wheels."
    },
    {
        "type": "Co-op",
        "description": "A housing arrangement where residents own shares in a corporation."
    },
    {
        "type": "Vacation Rental",
        "description": "A property rented out for short-term stays, often for vacations."
    },
    {
        "type": "Commercial",
        "description": "Property used for business purposes, such as offices or retail spaces."
    },
    {
        "type": "Industrial",
        "description": "Property used for manufacturing, warehousing, or other industrial purposes."
    },
    {
        "type": "Farm",
        "description": "Land used for agricultural purposes, including crop and livestock farming."
    },
    {
        "type": "Ranch",
        "description": "A large property used for raising livestock, often with a house."
    },
    {
        "type": "Luxury",
        "description": "High-end, upscale properties with luxurious amenities."
    },
    {
        "type": "Foreclosure",
        "description": "A property seized by a lender due to non-payment of a mortgage."
    },
    {
        "type": "Investment",
        "description": "Properties purchased for the purpose of generating rental income or capital gains."
    },
    {
        "type": "Historic",
        "description": "Properties with significant historical or architectural value."
    },
    {
        "type": "Waterfront",
        "description": "Properties located along bodies of water, such as lakes or oceans."
    },
    {
        "type": "Mountain View",
        "description": "Properties with scenic mountain views."
    },
    {
        "type": "Gated Community",
        "description": "Residential communities with controlled access and security gates."
    },
    {
        "type": "Suburban",
        "description": "Properties located in the suburbs, offering a quieter lifestyle."
    }
]